driver-tests/bpelse/nmproperty/SOAPHeaderCA/test/AccessSOAPHeaderLeafNodes/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:per="http://localhost/person">
   <soapenv:Header>
      <per:home country="US">
        <per:name>John Doe</per:name>
        <per:street>1000 Commerce Drive</per:street>
        <per:city>Pittsburgh</per:city>
        <per:state>PA</per:state>
        <per:zip>11520</per:zip>
        <!--0 to 3 repetitions:-->
        <per:note>header</per:note>
      </per:home>
   </soapenv:Header>    
  <soapenv:Body>
    <per:person name="John Doe">
      <per:birthdate>
        <per:month>Aug</per:month>
        <per:day>16</per:day>
        <per:year>2008</per:year>
      </per:birthdate>
      <per:home country="US">
        <per:name>John Doe</per:name>
        <per:street>Street1</per:street>
        <per:city>Monrovia</per:city>
        <per:state>CA</per:state>
        <per:zip>91016</per:zip>
      </per:home>
      <!--Optional:-->
      <per:work country="US">
        <per:name>John Doe</per:name>
        <per:street>Street1</per:street>
        <per:city>Arcadia</per:city>
        <per:state>CA</per:state>
        <per:zip>91007</per:zip>
      </per:work>
    </per:person>
  </soapenv:Body>
</soapenv:Envelope>